       IDENTIFICATION DIVISION.
       FUNCTION-ID. UUID4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 N-HELPER PIC X(4) VALUE "89AB".
       01 RND PIC 99 BINARY.
       01 HEX PIC X(2).
       01 STR-UUID4.
            05 UUID4-O1 PIC X.
            05 UUID4-O2 PIC X.
            05 UUID4-O3 PIC X.
            05 UUID4-O4 PIC X.
            05 UUID4-O5 PIC X.
            05 UUID4-O6 PIC X.
            05 UUID4-O7 PIC X.
            05 UUID4-O8 PIC X.
            05 UUID4-S1 PIC X VALUE "-".
            05 UUID4-O9 PIC X.
            05 UUID4-O10 PIC X.
            05 UUID4-O11 PIC X.
            05 UUID4-O12 PIC X.
            05 UUID4-S2 PIC X VALUE "-".
            05 UUID4-O13 PIC X VALUE "4".
            05 UUID4-O14 PIC X.
            05 UUID4-O15 PIC X.
            05 UUID4-O16 PIC X.
            05 UUID4-S3 PIC X VALUE "-".
            05 UUID4-O17 PIC X.
            05 UUID4-O18 PIC X.
            05 UUID4-O19 PIC X.
            05 UUID4-O20 PIC X.
            05 UUID4-S4 PIC X VALUE "-".
            05 UUID4-O21 PIC X.
            05 UUID4-O22 PIC X.
            05 UUID4-O23 PIC X.
            05 UUID4-O24 PIC X.
            05 UUID4-O25 PIC X.
            05 UUID4-O26 PIC X.
            05 UUID4-O27 PIC X.
            05 UUID4-O28 PIC X.
            05 UUID4-O29 PIC X.
            05 UUID4-O30 PIC X.
            05 UUID4-O31 PIC X.
            05 UUID4-O32 PIC X.
       LINKAGE SECTION.
       01 RETVAL PIC X(36).

       PROCEDURE DIVISION RETURNING RETVAL.
       000-MAIN.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O1.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O2.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O3.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O4.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O5.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O6.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O7.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O8.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O9.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O10.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O11.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O12.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O14.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O15.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O16.
       COMPUTE RND = ((FUNCTION RANDOM) * 4) + 1 .
       MOVE N-HELPER (RND : 1) TO UUID4-O17.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O18.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O19.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O20.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O21.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O22.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O23.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O24.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O25.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O26.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O27.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O28.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O29.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O30.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O31.
       COMPUTE RND = (FUNCTION RANDOM) * 16.
       MOVE FUNCTION HEX-OF(RND) TO HEX.
       MOVE HEX (2 : 1) TO UUID4-O32.
       MOVE STR-UUID4 TO RETVAL.
       GOBACK.
       END FUNCTION UUID4.


