       IDENTIFICATION DIVISION.
       PROGRAM-ID. UUID4TEST.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
         REPOSITORY. FUNCTION UUID4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NEW-UUID4 PIC X(36).
       PROCEDURE DIVISION.
       001-MAIN.
         DISPLAY FUNCTION UUID4.
         MOVE FUNCTION UUID4 TO NEW-UUID4.
         DISPLAY NEW-UUID4.
       STOP RUN.
         
